"""
10.2. Создайте новый класс с именем Thing2 и присвойте переменной letters значение 'abc'.
      Выведите на экран значение letters.
"""


class Thing2:
    pass


letters = "abc"
print(f"\n10.2. Создайте новый класс с именем Thing2 и присвойте переменной letters значение 'abc'.\
Выведите на экран значение letters.")
print(f"{letters = }\n")
